app/controllers/applications_controller.rb

	def create
		@app = Application.new(app_params)
		@app.save
---
INSERT INTO "applications" ("genre", "best_film", "writing_sample", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def index
		if session[:role] == "applicant"
			#@applications = Application.where_not(status:'archive').where(user_id: sessions[user_id])
		elsif session[:role] == "mentor"
	    	@applications = Application.where.not(status:'archive').where(genre: session[:genre]) #where status!=archive
		elsif session[:role] == 'admin'
	    	@applications = Application.where.not(status:'archive') #where status!=archive
---
SELECT "applications".* FROM "applications" WHERE ("applications"."status" != $1) AND "applications"."genre" IS NULL  [["status", "archive"]]
SELECT "applications".* FROM "applications"

	def show
  		@app = Application.find_by(id: params[:id])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT 1  [["id", 0]]