app/controllers/auth_controller.rb

    def login
        user = User.find_by(login_email: app_params[:login_email])
        if user && user.authenticate(app_params[:login_email],app_params[:login_password])
            session[:user_id] = user.id
            session[:genre] = user.genre
            session[:role] = Role.find(user.role_id).role
---
SELECT  "users".* FROM "users" WHERE "users"."login_email" = $1 LIMIT 1  [["login_email", "gxavier@gmail.com"]]
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 2]]