app/controllers/users_controller.rb

	def create
		@user = User.new(app_params)
    	if @user.save
---
INSERT INTO "users" ("login_email", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["login_email", "md@hotmama.com"], ["first_name", "Merridawn"], ["last_name", "Duckler"], ["created_at", "2015-06-18 19:45:00.201834"], ["updated_at", "2015-06-18 19:45:00.201834"]]